[NoCoverage] StringLiteral
ngx-stryker-robobar/src/app/app-routing.module.ts:20:11
         esModule => esModule.ReviewOrderModule,
       ),
   },
-  { path: 'success', loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },
+  { path: "", loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },
   {
     path: '**',
