[NoCoverage] ConditionalExpression
LayZeeDK/ngx-stryker-robobar/src/main.ts:7:5
 import { AppModule } from './app/app.module';
 import { environment } from './environments/environment';
 
-if (environment.production) {
+if (false) {
   enableProdMode();
 }
