[NoCoverage] ObjectLiteral
ngx-stryker-robobar/src/app/app-routing.module.ts:5:3
 import { RouterModule, Routes } from '@angular/router';
 
 const routes: Routes = [
-  {
-    path: '',
-    pathMatch: 'full',
-    loadChildren: () =>
-      import('./place-order/place-order.module').then(
-        esModule => esModule.PlaceOrderModule,
-      ),
-  },
+  {},
   {
     path: 'review',

[NoCoverage] ArrowFunction
ngx-stryker-robobar/src/app/app-routing.module.ts:8:19
   {
     path: '',
     pathMatch: 'full',
-    loadChildren: () =>
-      import('./place-order/place-order.module').then(
-        esModule => esModule.PlaceOrderModule,
-      ),
+    loadChildren: () => undefined,
   },
   {

[NoCoverage] StringLiteral
ngx-stryker-robobar/src/app/app-routing.module.ts:9:14
     path: '',
     pathMatch: 'full',
     loadChildren: () =>
-      import('./place-order/place-order.module').then(
+      import("").then(
         esModule => esModule.PlaceOrderModule,
       ),

[NoCoverage] ArrowFunction
ngx-stryker-robobar/src/app/app-routing.module.ts:10:9
     pathMatch: 'full',
     loadChildren: () =>
       import('./place-order/place-order.module').then(
-        esModule => esModule.PlaceOrderModule,
+        () => undefined,
       ),
   },

[NoCoverage] ObjectLiteral
ngx-stryker-robobar/src/app/app-routing.module.ts:13:3
         esModule => esModule.PlaceOrderModule,
       ),
   },
-  {
-    path: 'review',
-    loadChildren: () =>
-      import('./review-order/review-order.module').then(
-        esModule => esModule.ReviewOrderModule,
-      ),
-  },
+  {},
   { path: 'success', loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },
   {

[NoCoverage] ArrowFunction
ngx-stryker-robobar/src/app/app-routing.module.ts:15:19
   },
   {
     path: 'review',
-    loadChildren: () =>
-      import('./review-order/review-order.module').then(
-        esModule => esModule.ReviewOrderModule,
-      ),
+    loadChildren: () => undefined,
   },
   { path: 'success', loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },

[NoCoverage] StringLiteral
ngx-stryker-robobar/src/app/app-routing.module.ts:16:14
   {
     path: 'review',
     loadChildren: () =>
-      import('./review-order/review-order.module').then(
+      import("").then(
         esModule => esModule.ReviewOrderModule,
       ),

[NoCoverage] ArrowFunction
ngx-stryker-robobar/src/app/app-routing.module.ts:17:9
     path: 'review',
     loadChildren: () =>
       import('./review-order/review-order.module').then(
-        esModule => esModule.ReviewOrderModule,
+        () => undefined,
       ),
   },

[NoCoverage] ArrowFunction
ngx-stryker-robobar/src/app/app-routing.module.ts:20:82
         esModule => esModule.ReviewOrderModule,
       ),
   },
-  { path: 'success', loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },
+  { path: 'success', loadChildren: () => import('./success/success.module').then(() => undefined) },
   {
     path: '**',

[NoCoverage] ArrowFunction
ngx-stryker-robobar/src/app/app-routing.module.ts:20:36
         esModule => esModule.ReviewOrderModule,
       ),
   },
-  { path: 'success', loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },
+  { path: 'success', loadChildren: () => undefined },
   {
     path: '**',

[NoCoverage] ObjectLiteral
ngx-stryker-robobar/src/app/app-routing.module.ts:21:3
       ),
   },
   { path: 'success', loadChildren: () => import('./success/success.module').then(m => m.SuccessModule) },
-  {
-    path: '**',
-    redirectTo: '/',
-  },
+  {},
 ];
 
