[Killed] BlockStatement
src/app/data-access/order.service.ts:13:47
   // tslint:disable-next-line: variable-name
   _currentOrder: readonly Drink[] | null = null;
 
-  get currentOrder(): readonly Drink[] | null {
-    if (!this._currentOrder && this.storage.getItem('currentOrder')) {
-      this._currentOrder =
-        JSON.parse(this.storage.getItem('currentOrder') ?? '') ?? null;
-    }
-
-    return this._currentOrder;
-  }
+  get currentOrder(): readonly Drink[] | null {}
 
   set currentOrder(value: readonly Drink[] | null) {

[Killed] LogicalOperator
src/app/data-access/order.service.ts:14:9
   _currentOrder: readonly Drink[] | null = null;
 
   get currentOrder(): readonly Drink[] | null {
-    if (!this._currentOrder && this.storage.getItem('currentOrder')) {
+    if (!this._currentOrder || this.storage.getItem('currentOrder')) {
       this._currentOrder =
         JSON.parse(this.storage.getItem('currentOrder') ?? '') ?? null;

[Killed] BlockStatement
src/app/data-access/order.service.ts:14:70
   _currentOrder: readonly Drink[] | null = null;
 
   get currentOrder(): readonly Drink[] | null {
-    if (!this._currentOrder && this.storage.getItem('currentOrder')) {
-      this._currentOrder =
-        JSON.parse(this.storage.getItem('currentOrder') ?? '') ?? null;
-    }
+    if (!this._currentOrder && this.storage.getItem('currentOrder')) {}
 
     return this._currentOrder;

[Survived] BlockStatement
src/app/data-access/order.service.ts:22:52
     return this._currentOrder;
   }
 
-  set currentOrder(value: readonly Drink[] | null) {
-    this._currentOrder = value;
-    this.storage.setItem('currentOrder', JSON.stringify(value));
-  }
+  set currentOrder(value: readonly Drink[] | null) {}
 
   constructor(@Inject(storageToken) private storage: Storage) {}

[NoCoverage] BlockStatement
src/app/data-access/order.service.ts:29:17
 
   constructor(@Inject(storageToken) private storage: Storage) {}
 
-  clear(): void {
-    this.currentOrder = null;
-  }
+  clear(): void {}
 }
 
