[Survived] BooleanLiteral
src/app/review-order/review-order.component.ts:16:20
 export class ReviewOrderComponent implements OnInit {
   age?: number;
   error: string | null = null;
-  shouldCheckAge = false;
+  shouldCheckAge = true;
   numberOfDrinks = 0;
   order: readonly Drink[] = [];

[Killed] BlockStatement
src/app/review-order/review-order.component.ts:22:35
 
   constructor(private orderService: OrderService, private router: Router) {}
 
-  async ngOnInit(): Promise<void> {
-    if (!this.orderService.currentOrder) {
-      await this.router.navigateByUrl('/');
-    }
-
-    this.order = this.orderService.currentOrder ?? [];
-    this.numberOfDrinks = this.order.reduce(
-      (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
-      0,
-    );
-    this.shouldCheckAge = this.order.some(drink => drink.isAlcoholic);
-  }
+  async ngOnInit(): Promise<void> {}
 
   async onSubmit(): Promise<void> {

[Killed] ConditionalExpression
src/app/review-order/review-order.component.ts:23:9
   constructor(private orderService: OrderService, private router: Router) {}
 
   async ngOnInit(): Promise<void> {
-    if (!this.orderService.currentOrder) {
+    if (false) {
       await this.router.navigateByUrl('/');
     }

[Killed] ConditionalExpression
src/app/review-order/review-order.component.ts:23:9
   constructor(private orderService: OrderService, private router: Router) {}
 
   async ngOnInit(): Promise<void> {
-    if (!this.orderService.currentOrder) {
+    if (true) {
       await this.router.navigateByUrl('/');
     }

[Survived] ArrowFunction
src/app/review-order/review-order.component.ts:29:7
 
     this.order = this.orderService.currentOrder ?? [];
     this.numberOfDrinks = this.order.reduce(
-      (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
+      () => undefined,
       0,
     );

[Survived] ArithmeticOperator
src/app/review-order/review-order.component.ts:29:34
 
     this.order = this.orderService.currentOrder ?? [];
     this.numberOfDrinks = this.order.reduce(
-      (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
+      (numberOfDrinks, drink) => numberOfDrinks - drink.amount,
       0,
     );

[Survived] ArrowFunction
src/app/review-order/review-order.component.ts:32:43
       (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
       0,
     );
-    this.shouldCheckAge = this.order.some(drink => drink.isAlcoholic);
+    this.shouldCheckAge = this.order.some(() => undefined);
   }
 

[NoCoverage] BlockStatement
src/app/review-order/review-order.component.ts:35:35
     this.shouldCheckAge = this.order.some(drink => drink.isAlcoholic);
   }
 
-  async onSubmit(): Promise<void> {
-    if (
-      !this.shouldCheckAge ||
-      this.isAllowedToBuyAlcohol({ age: this.age ?? 0 })
-    ) {
-      this.error = null;
-      await this.router.navigateByUrl('/success');
-    } else {
-      this.error = 'Only adults can buy alcohol!';
-    }
-  }
+  async onSubmit(): Promise<void> {}
 
   async onCancel(): Promise<void> {

[NoCoverage] LogicalOperator
src/app/review-order/review-order.component.ts:37:7
 
   async onSubmit(): Promise<void> {
     if (
-      !this.shouldCheckAge ||
-      this.isAllowedToBuyAlcohol({ age: this.age ?? 0 })
+      !this.shouldCheckAge && this.isAllowedToBuyAlcohol({
+  age: this.age ?? 0
+})
     ) {
       this.error = null;

[NoCoverage] ConditionalExpression
src/app/review-order/review-order.component.ts:37:7
 
   async onSubmit(): Promise<void> {
     if (
-      !this.shouldCheckAge ||
-      this.isAllowedToBuyAlcohol({ age: this.age ?? 0 })
+      true
     ) {
       this.error = null;

[NoCoverage] BlockStatement
src/app/review-order/review-order.component.ts:39:7
     if (
       !this.shouldCheckAge ||
       this.isAllowedToBuyAlcohol({ age: this.age ?? 0 })
-    ) {
-      this.error = null;
-      await this.router.navigateByUrl('/success');
-    } else {
+    ) {} else {
       this.error = 'Only adults can buy alcohol!';
     }

[NoCoverage] StringLiteral
src/app/review-order/review-order.component.ts:41:39
       this.isAllowedToBuyAlcohol({ age: this.age ?? 0 })
     ) {
       this.error = null;
-      await this.router.navigateByUrl('/success');
+      await this.router.navigateByUrl("");
     } else {
       this.error = 'Only adults can buy alcohol!';

[NoCoverage] BlockStatement
src/app/review-order/review-order.component.ts:42:12
     ) {
       this.error = null;
       await this.router.navigateByUrl('/success');
-    } else {
-      this.error = 'Only adults can buy alcohol!';
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/app/review-order/review-order.component.ts:47:35
     }
   }
 
-  async onCancel(): Promise<void> {
-    this.orderService.clear();
-    await this.router.navigateByUrl('/');
-  }
+  async onCancel(): Promise<void> {}
 
   private isAllowedToBuyAlcohol(customer: Customer): boolean {

[NoCoverage] StringLiteral
src/app/review-order/review-order.component.ts:49:37
 
   async onCancel(): Promise<void> {
     this.orderService.clear();
-    await this.router.navigateByUrl('/');
+    await this.router.navigateByUrl("");
   }
 

[NoCoverage] BlockStatement
src/app/review-order/review-order.component.ts:52:62
     await this.router.navigateByUrl('/');
   }
 
-  private isAllowedToBuyAlcohol(customer: Customer): boolean {
-    return customer.age > 18;
-  }
+  private isAllowedToBuyAlcohol(customer: Customer): boolean {}
 }
 

[NoCoverage] EqualityOperator
src/app/review-order/review-order.component.ts:53:12
   }
 
   private isAllowedToBuyAlcohol(customer: Customer): boolean {
-    return customer.age > 18;
+    return customer.age <= 18;
   }
 }

[NoCoverage] EqualityOperator
src/app/review-order/review-order.component.ts:53:12
   }
 
   private isAllowedToBuyAlcohol(customer: Customer): boolean {
-    return customer.age > 18;
+    return customer.age >= 18;
   }
 }
