[Survived] BlockStatement
src/app/success/success.component.ts:15:20
 
   constructor(private orderService: OrderService) {}
 
-  ngOnInit(): void {
-    this.numberOfDrinks = (this.orderService.currentOrder ?? []).reduce(
-      (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
-      0,
-    );
-  }
+  ngOnInit(): void {}
 }
 

[Survived] ArrowFunction
src/app/success/success.component.ts:17:7
 
   ngOnInit(): void {
     this.numberOfDrinks = (this.orderService.currentOrder ?? []).reduce(
-      (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
+      () => undefined,
       0,
     );

[NoCoverage] ArithmeticOperator
src/app/success/success.component.ts:17:34
 
   ngOnInit(): void {
     this.numberOfDrinks = (this.orderService.currentOrder ?? []).reduce(
-      (numberOfDrinks, drink) => numberOfDrinks + drink.amount,
+      (numberOfDrinks, drink) => numberOfDrinks - drink.amount,
       0,
     );
