[Killed] BlockStatement
src/app/data-access/drink.service.ts:9:33
   providedIn: 'root',
 })
 export class DrinkService {
-  getDrinks(): readonly Drink[] {
-    return [
-      { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-      { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
-      { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },
-    ];
-  }
+  getDrinks(): readonly Drink[] {}
 }
 

[Killed] ArrayDeclaration
src/app/data-access/drink.service.ts:10:12
 })
 export class DrinkService {
   getDrinks(): readonly Drink[] {
-    return [
-      { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-      { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
-      { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },
-    ];
+    return [];
   }
 }

[Survived] BooleanLiteral
src/app/data-access/drink.service.ts:11:65
 export class DrinkService {
   getDrinks(): readonly Drink[] {
     return [
-      { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
+      { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: true },
       { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
       { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },

[Survived] BooleanLiteral
src/app/data-access/drink.service.ts:12:64
   getDrinks(): readonly Drink[] {
     return [
       { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-      { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
+      { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: false },
       { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },
     ];

[Survived] ObjectLiteral
src/app/data-access/drink.service.ts:12:7
   getDrinks(): readonly Drink[] {
     return [
       { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-      { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
+      {},
       { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },
     ];

[Survived] BooleanLiteral
src/app/data-access/drink.service.ts:13:64
     return [
       { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
       { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
-      { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },
+      { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: false },
     ];
   }

[Killed] ObjectLiteral
src/app/data-access/drink.service.ts:13:7
     return [
       { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
       { name: 'Robo Beer', price: 2.0, amount: 0, isAlcoholic: true },
-      { name: 'Rob(w)ine', price: 3.0, amount: 0, isAlcoholic: true },
+      {},
     ];
   }
