[Survived] StringLiteral
src/app/data-access/storage.token.ts:3:48
 import { InjectionToken } from '@angular/core';
 
-export const storageToken = new InjectionToken('Storage', {
+export const storageToken = new InjectionToken("", {
   factory: (): Storage => localStorage,
   providedIn: 'root',

[Killed] ArrowFunction
src/app/data-access/storage.token.ts:4:12
 import { InjectionToken } from '@angular/core';
 
 export const storageToken = new InjectionToken('Storage', {
-  factory: (): Storage => localStorage,
+  factory: () => undefined,
   providedIn: 'root',
 });
