[Killed] BlockStatement
src/app/place-order/place-order.component.ts:16:34
 export class PlaceOrderComponent implements OnInit {
   drinks: readonly Drink[] = [];
 
-  get isSubmitEnabled(): boolean {
-    return this.drinks.some(drink => drink.amount > 0);
-  }
+  get isSubmitEnabled(): boolean {}
 
   get totalPrice(): number {

[Killed] EqualityOperator
src/app/place-order/place-order.component.ts:17:38
   drinks: readonly Drink[] = [];
 
   get isSubmitEnabled(): boolean {
-    return this.drinks.some(drink => drink.amount > 0);
+    return this.drinks.some(drink => drink.amount >= 0);
   }
 

[Killed] EqualityOperator
src/app/place-order/place-order.component.ts:17:38
   drinks: readonly Drink[] = [];
 
   get isSubmitEnabled(): boolean {
-    return this.drinks.some(drink => drink.amount > 0);
+    return this.drinks.some(drink => drink.amount <= 0);
   }
 

[Killed] BlockStatement
src/app/place-order/place-order.component.ts:20:28
     return this.drinks.some(drink => drink.amount > 0);
   }
 
-  get totalPrice(): number {
-    return this.drinks.reduce(
-      (total, drink) => total + drink.amount * drink.price,
-      0,
-    );
-  }
+  get totalPrice(): number {}
 
   constructor(

[Killed] ArithmeticOperator
src/app/place-order/place-order.component.ts:22:25
 
   get totalPrice(): number {
     return this.drinks.reduce(
-      (total, drink) => total + drink.amount * drink.price,
+      (total, drink) => total - drink.amount * drink.price,
       0,
     );

[Killed] ArithmeticOperator
src/app/place-order/place-order.component.ts:22:33
 
   get totalPrice(): number {
     return this.drinks.reduce(
-      (total, drink) => total + drink.amount * drink.price,
+      (total, drink) => total + drink.amount / drink.price,
       0,
     );

[Killed] BlockStatement
src/app/place-order/place-order.component.ts:33:20
     private router: Router,
   ) {}
 
-  ngOnInit(): void {
-    this.drinks = this.drinkService.getDrinks();
-  }
+  ngOnInit(): void {}
 
   onDecrement(drink: Drink): void {

[Killed] BlockStatement
src/app/place-order/place-order.component.ts:37:35
     this.drinks = this.drinkService.getDrinks();
   }
 
-  onDecrement(drink: Drink): void {
-    drink.amount -= 1;
-
-    if (drink.amount < 0) {
-      drink.amount = 0;
-    }
-  }
+  onDecrement(drink: Drink): void {}
 
   onIncrement(drink: Drink): void {

[Killed] BlockStatement
src/app/place-order/place-order.component.ts:40:27
   onDecrement(drink: Drink): void {
     drink.amount -= 1;
 
-    if (drink.amount < 0) {
-      drink.amount = 0;
-    }
+    if (drink.amount < 0) {}
   }
 

[Killed] ConditionalExpression
src/app/place-order/place-order.component.ts:40:9
   onDecrement(drink: Drink): void {
     drink.amount -= 1;
 
-    if (drink.amount < 0) {
+    if (true) {
       drink.amount = 0;
     }

[Killed] BlockStatement
src/app/place-order/place-order.component.ts:45:35
     }
   }
 
-  onIncrement(drink: Drink): void {
-    drink.amount += 1;
-  }
+  onIncrement(drink: Drink): void {}
 
   async onSubmit(): Promise<void> {

[Killed] BlockStatement
src/app/place-order/place-order.component.ts:49:35
     drink.amount += 1;
   }
 
-  async onSubmit(): Promise<void> {
-    this.orderService.currentOrder = this.drinks.filter(drink => drink.amount);
-    await this.router.navigateByUrl('/review');
-  }
+  async onSubmit(): Promise<void> {}
 }
 

[Survived] ArrowFunction
src/app/place-order/place-order.component.ts:50:57
   }
 
   async onSubmit(): Promise<void> {
-    this.orderService.currentOrder = this.drinks.filter(drink => drink.amount);
+    this.orderService.currentOrder = this.drinks.filter(() => undefined);
     await this.router.navigateByUrl('/review');
   }
