[Survived] ArrayDeclaration
src/app/place-order/place-order.module.ts:8:24
 
 import { PlaceOrderComponent } from './place-order.component';
 
-const routes: Routes = [
-  {
-    path: '',
-    pathMatch: 'full',
-    component: PlaceOrderComponent,
-  },
-];
+const routes: Routes = [];
 
 @NgModule({

[Survived] StringLiteral
src/app/place-order/place-order.module.ts:10:11
 
 const routes: Routes = [
   {
-    path: '',
+    path: "Stryker was here!",
     pathMatch: 'full',
     component: PlaceOrderComponent,

[Killed] StringLiteral
src/app/place-order/place-order.module.ts:11:16
 const routes: Routes = [
   {
     path: '',
-    pathMatch: 'full',
+    pathMatch: "",
     component: PlaceOrderComponent,
   },
