[Survived] ArrayDeclaration
src/app/success/success.module.ts:7:24
 
 import { SuccessComponent } from './success.component';
 
-const routes: Routes = [{ path: '', component: SuccessComponent }];
+const routes: Routes = [];
 
 @NgModule({
